EDT/УТ/src/InformationRegisters/ozone_БланкиЗаказов/ozone_БланкиЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ozone_БланкиЗаказов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Бланк</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипБланка</name>
    <type>
      <types>EnumRef.ozone_ТипыБланковЗаказов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ozone_БланкиЗаказов/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Функция ПолучитьДвоичныеДанные()
	
	Запрос = новый Запрос("ВЫБРАТЬ
	                      |	ozone_БланкиЗаказов.Бланк
	                      |ИЗ
	                      |	РегистрСведений.ozone_БланкиЗаказов КАК ozone_БланкиЗаказов
	                      |ГДЕ
	                      |	ozone_БланкиЗаказов.Период = &Период
	                      |	И ozone_БланкиЗаказов.Заказ = &Заказ
	                      |	И ozone_БланкиЗаказов.ТипБланка = &ТипБланка");
	Запрос.УстановитьПараметр("Период", Запись.Период);
	Запрос.УстановитьПараметр("Заказ", Запись.Заказ);
	Запрос.УстановитьПараметр("ТипБланка", Запись.ТипБланка);
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда	
		ДвоичныеДанные = Рез.Бланк.Получить();	
		Возврат ДвоичныеДанные;
	Иначе
		Возврат Неопределено;	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Напечатать(Команда)
	
	ДвоичныеДанные = ПолучитьДвоичныеДанные();	
	
	Если ЗначениеЗаполнено(ДвоичныеДанные) Тогда		
		ПутьКФайлу = КаталогВременныхФайлов() +  "\" + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd") + Запись.ТипБланка + Запись.Заказ.Номер + ".pdf";
		ДвоичныеДанные.Записать(ПутьКФайлу);
		ЗапуститьПриложение(ПутьКФайлу);		
	Иначе	
		#Если Клиент Тогда
			Сообщить("Бланк не найден");
		#КонецЕсли		
	КонецЕсли;
	
КонецПроцедуры
